app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE   (
`username` = 'TESTESTTEST'
OR `email` = 'TEST@gmail.com'
 )
 LIMIT 1
---
    public function registerProcess()
    {
        $model = new UserModel();
        $username = trim((string) $this->request->getPost('username'));
        $email = trim((string) $this->request->getPost('email'));
        $password = (string) $this->request->getPost('password');
        $confirmPassword = (string) $this->request->getPost('confirm_password');

        if ($username === '' || $email === '' || $password === '' || $confirmPassword === '') {
            return redirect()->back()->withInput()->with('error', 'Complete all fields before signing up.');
        }

        if (mb_strlen($username) < 3) {
            return redirect()->back()->withInput()->with('error', 'Username must be at least 3 characters.');
        }

        if (! filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return redirect()->back()->withInput()->with('error', 'Enter a valid email address.');
        }

        if (mb_strlen($password) < 6) {
            return redirect()->back()->withInput()->with('error', 'Password must be at least 6 characters.');
        }

        if ($password !== $confirmPassword) {
            return redirect()->back()->withInput()->with('error', 'Passwords do not match.');
        }

        $existingUser = $model
            ->groupStart()
            ->where('username', $username)
            ->orWhere('email', $email)
            ->groupEnd()
            ->first();

INSERT INTO `users` (`username`, `email`, `password`, `created_at`) VALUES ('TESTESTTEST', 'TEST@gmail.com', '$2y$10$F6tzQlyY69xtgMTPna6SQ.9hVGHQSmuQfecMqoSh5xJytj7mtc0o2', '2026-09-30 10:33:18')
---
            return redirect()->back()->withInput()->with('error', 'That username or email is already taken.');
        }

        $model->save([
            'username' => $username,
            'email' => $email,
            'password' => password_hash($password, PASSWORD_DEFAULT),
            'created_at' => date('Y-m-d H:i:s'),
        ]);